# RasterSymbolFilename Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RasterSymbolFilename Property
ParameterTypeId Class See Also
---
"Loaded from file"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RasterSymbolFilename { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RasterSymbolFilename As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RasterSymbolFilename {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace